README.org
* About

This will be a page where I will store all the quotes that I have read/heard/saw during my travel years. I like to keep things. And share with others.

Trying to work with Django as well as databases. It's completely new for me, but I like how much control it gives me.

Not paying much importance to front end stuff with this project.

* Todo
** Easy
   :LOGBOOK:
   - Note taken on [2021-09-04 Št 16:23] \\
     gdgfg
   :END:
- [ ] (need help) front page only one quote, not all of them. Next/previous/random buttons
- [X] <2021-09-04 Št> from which book the quote was taken from
- [X] <2021-09-04 Št> Navigation bar with sections(categories, athors, books, etc)
- [X] <2021-08-30 Pr> Karina helped with models, amazing, thanks!!
- [ ] <2021-08-30 Pr> First ever pull request with Git by Karina!!
** Moderate
- [ ] let viewers vote how much they like a certain quote (smileys)
- [ ] breadcrums so the user doesnt get lost in the site /books/author/etc
- [ ] paspaudus ant quote - show other quotes to explore (related quotes)
** Difficult
- [ ] Let users publish their own quotes after I review them? idk sounds tough
- [ ] random quotes generator
  - [ ] tuscias langas su vienu mygtuku
  - [ ] paspaudus ant mygtuko, islenda laukelis su randomly sugeneruota quote
  - [ ] paspaudus mygtuka dar karta - quote pasikeici


