README.md

# Table of Contents

1.  [About](#org0f4fb60)
2.  [Todo](#orgb8a473b)
    1.  [Easy](#org6593287)
    2.  [Moderate](#orgee7969c)
    3.  [Difficult](#org51c25c4)


<a id="org0f4fb60"></a>

# About

This will be a page where I will store all the quotes that I have read/heard/saw during my travel years. I like to keep things. And share with others.

Trying to work with Django as well as databases. It's completely new for me, but I like how much control it gives me.

Not paying much importance to front end stuff with this project.


<a id="orgb8a473b"></a>

# Todo


<a id="org6593287"></a>

## Easy

-   [ ] (need help) front page only one quote, not all of them. Next/previous/random buttons
-   [X] <span class="timestamp-wrapper"><span class="timestamp">&lt;2021-09-04 Št&gt; </span></span> from which book the quote was taken from
-   [X] <span class="timestamp-wrapper"><span class="timestamp">&lt;2021-09-04 Št&gt; </span></span> Navigation bar with sections(categories, athors, books, etc)
-   [X] <span class="timestamp-wrapper"><span class="timestamp">&lt;2021-08-30 Pr&gt; </span></span> Karina helped with models, amazing, thanks!!
-   [ ] <span class="timestamp-wrapper"><span class="timestamp">&lt;2021-08-30 Pr&gt; </span></span> First ever pull request with Git by Karina!!


<a id="orgee7969c"></a>

## Moderate

-   [ ] let viewers vote how much they like a certain quote (smileys)
-   [ ] breadcrums so the user doesnt get lost in the site /books/author/etc
-   [ ] paspaudus ant quote - show other quotes to explore (related quotes)


<a id="org51c25c4"></a>

## Difficult

-   [ ] Let users publish their own quotes after I review them? idk sounds tough
-   [ ] random quotes generator
    -   [ ] tuscias langas su vienu mygtuku
    -   [ ] paspaudus ant mygtuko, islenda laukelis su randomly sugeneruota quote
    -   [ ] paspaudus mygtuka dar karta - quote pasikeici

